src/DataProcessors/Расписание/Расписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Расписание</name>
  <attributes>
    <name>Программа</name>
    <type>
      <types>CatalogRef.УчебныеПрограммы</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/НомераПарВремяСоответсвие/НомераПарВремяСоответсвие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераПарВремяСоответсвие</name>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерПары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗадачаСотрудника/ЗадачаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаСотрудника</name>
  <registerRecords>AccumulationRegister.НагрузкаПреподавателей</registerRecords>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дистанционное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятия</name>
    <type>
      <types>EnumRef.ТипыЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Программа</name>
    <type>
      <types>CatalogRef.УчебныеПрограммы</types>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/УчебныеПрограммы/УчебныеПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеПрограммы</name>
  <attributes>
    <name>ВидПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрограммыСокращенно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГрупп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСлушателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУчебныхЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрограммыСокращенно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>EnumRef.Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПрограммы</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормыОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаправленияПодготовки</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияПодготовки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Преподаватели</name>
    <attributes>
      <name>ИТПрактик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтраслевойПартнер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Расписание/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗагрузитьРасписаниеНаСервере(Программа, Преподаватель, Число(Месяц(ДатаОтображения)));
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРасписаниеНаСервере(ПрограммаСсылка, ПреподавательФильтр, Месяц)
	
	Если ПрограммаСсылка.Преподаватели.Количество() = 0 Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "В программе нет преподавателей!";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	Недели = ПолучитьНомераНедель(Месяц);
	
	Для Каждого СтрокаПреподаватель Из ПрограммаСсылка.Преподаватели Цикл
		
		ТекущийПреподаватель = СтрокаПреподаватель.Преподаватель;
		
		Если ПреподавательФильтр <> Справочники.Сотрудники.ПустаяСсылка() И ТекущийПреподаватель <> ПреподавательФильтр Тогда
			Продолжить;
		КонецЕсли;
		
		ФИОТранслитом = ПреобразованиеФИОТранслитом(ТекущийПреподаватель.Наименование);
		
		//@skip-check query-in-loop
		УдалитьСуществующиеЗадачи(ТекущийПреподаватель, Недели[0], Недели[Недели.Количество() - 1], Месяц);
		
		Для Каждого НомерНедели Из Недели Цикл
			Результат = ПолучитьJSONПоСсылке(ФИОТранслитом, НомерНедели);
			
			СоздатьЗадачиПоРасписанию(Результат, НомерНедели, ТекущийПреподаватель, Месяц, ПрограммаСсылка);
		КонецЦикла;
	КонецЦикла;
	
	ОбновитьДанныеПланировщикаСервер();
КонецПроцедуры

&НаСервере
Процедура УдалитьСуществующиеЗадачи(ПреподавательСсылка, НомерНеделиНачало, НомерНеделиКонец, Месяц)
	ТекущийГод = Год(ТекущаяДатаСеанса());
	
	ДатаНачалаМесяца = Дата(ТекущийГод, Месяц, 1);
	ДатаОкончанияМесяца = КонецМесяца(ДатаНачалаМесяца);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаСотрудника.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|ГДЕ
		|	ЗадачаСотрудника.Преподаватель = &Преподаватель
		|	И ЗадачаСотрудника.Основная = ИСТИНА
		|	И ЗадачаСотрудника.ДатаНачала >= &ДатаНачала
		|	И ЗадачаСотрудника.ДатаОкончания <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Преподаватель", ПреподавательСсылка);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаМесяца);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончанияМесяца);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектЗадачи = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗадачи.УстановитьПометкуУдаления(Истина);
		ОбъектЗадачи.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомераНедель(Месяц)
	
	ТекущийГод = Год(ТекущаяДатаСеанса());
	ПредыдущийГод = ТекущийГод - 1;
	
	СентябрьНомер = 9;
	ДатаНачалаУчебногоГода = Дата(ПредыдущийГод, СентябрьНомер, 1);
	ДатаНачалаМесяца = Дата(ТекущийГод, Месяц, 1);
	ДатаОкончанияМесяца = КонецМесяца(ДатаНачалаМесяца);
	СчетДаты = ДатаНачалаУчебногоГода;
	СчетчикНедель = 1;
	
	ДнейВНеделе = 7;
	Сутки = 24;
	МинутыСекунды = 60;
	Неделя = ДнейВНеделе * Сутки * МинутыСекунды * МинутыСекунды;
	
	Пока ДатаНачалаМесяца >= СчетДаты + Неделя Цикл
		СчетДаты = СчетДаты + Неделя;
		СчетчикНедель = СчетчикНедель + 1;
	КонецЦикла;
	
	МассивНедель = Новый Массив;
	МассивНедель.Добавить(СчетчикНедель);
	
	Пока ДатаОкончанияМесяца >= СчетДаты + Неделя Цикл
		СчетДаты = СчетДаты + Неделя;
		СчетчикНедель = СчетчикНедель + 1;
		МассивНедель.Добавить(СчетчикНедель);
	КонецЦикла;
	
	Возврат МассивНедель;
	
КонецФункции

&НаСервере
Функция ПреобразованиеФИОТранслитом(Знач ФИО)
	
	ФИО = НРег(ФИО);
	ФИО = СтрЗаменить(ФИО, "ё", "е");
	ФИО = СтрЗаменить(ФИО, " ", "-");
	
	ТаблицаТранслита = Новый Соответствие;
	ТаблицаТранслита.Вставить("а", "a");
	ТаблицаТранслита.Вставить("б", "b");
	ТаблицаТранслита.Вставить("в", "v");
	ТаблицаТранслита.Вставить("г", "g");
	ТаблицаТранслита.Вставить("д", "d");
	ТаблицаТранслита.Вставить("е", "e");
	ТаблицаТранслита.Вставить("ж", "zh");
	ТаблицаТранслита.Вставить("з", "z");
	ТаблицаТранслита.Вставить("и", "i");
	ТаблицаТранслита.Вставить("й", "j");
	ТаблицаТранслита.Вставить("к", "k");
	ТаблицаТранслита.Вставить("л", "l");
	ТаблицаТранслита.Вставить("м", "m");
	ТаблицаТранслита.Вставить("н", "n");
	ТаблицаТранслита.Вставить("о", "o");
	ТаблицаТранслита.Вставить("п", "p");
	ТаблицаТранслита.Вставить("р", "r");
	ТаблицаТранслита.Вставить("с", "s");
	ТаблицаТранслита.Вставить("т", "t");
	ТаблицаТранслита.Вставить("у", "u");
	ТаблицаТранслита.Вставить("ф", "f");
	ТаблицаТранслита.Вставить("х", "h");
	ТаблицаТранслита.Вставить("ц", "c");
	ТаблицаТранслита.Вставить("ч", "ch");
	ТаблицаТранслита.Вставить("ш", "sh");
	ТаблицаТранслита.Вставить("щ", "sh");
	ТаблицаТранслита.Вставить("ъ", "u");
	ТаблицаТранслита.Вставить("ы", "y");
	ТаблицаТранслита.Вставить("ь", "");
	ТаблицаТранслита.Вставить("э", "e");
	ТаблицаТранслита.Вставить("ю", "yu");
	ТаблицаТранслита.Вставить("я", "ya");
	
	Результат = "";
	Для Инд = 1 По СтрДлина(ФИО) Цикл
		Символ = Сред(ФИО, Инд, 1);
		
		Если ТаблицаТранслита.Получить(Символ) <> Неопределено Тогда
			Результат = Результат + ТаблицаТранслита.Получить(Символ);
		Иначе
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьJSONПоСсылке(ФИОТранслитом, НомерНедели)
	
	Успех = Новый Структура("КодУспеха", 200);
	Таймаут = 30;
	
	ПараметрыЗапроса = "v=6.1&teacher=" + ФИОТранслитом + "&week=" + Формат(НомерНедели, "ЧГ=0");
	
	HTTPСоединение = Новый HTTPСоединение(
		"schedule.sevsu.ru", 
		, 
		, 
		, 
		, 
		Таймаут, 
		Новый ЗащищенноеСоединениеOpenSSL());
		
	HTTPЗапрос = Новый HTTPЗапрос("/api/teacher-schedule?" + ПараметрыЗапроса);
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния <> Успех.КодУспеха Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьЗадачиПоРасписанию(РезультатJSON, НомерНедели, ПреподавательСсылка, Месяц, ПрограммаСсылка)
	
	Если РезультатJSON = Неопределено Или НЕ РезультатJSON.ok Тогда
		Возврат;
	КонецЕсли;
	
	Расписание = РезультатJSON.schedule;
	
	ТекущийГод = Год(ТекущаяДатаСеанса());
	ДатаНачалаМесяца = Дата(ТекущийГод, Месяц, 1);
	
	Для Каждого Занятие Из Расписание Цикл				
		ДатаЗанятия = Дата(СтрЗаменить(Занятие.date, "-", ""));
		
		Если ДатаЗанятия <= ДатаНачалаМесяца Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйДокумент = Документы.ЗадачаСотрудника.СоздатьДокумент();
		НовыйДокумент.Преподаватель = ПреподавательСсылка;
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НомерЗанятия = Занятие.n;
		
		Отбор = Новый Структура("НомерПары", НомерЗанятия);
		ВремяНачала = РегистрыСведений.НомераПарВремяСоответсвие.Получить(Отбор).ВремяНачала;
		ВремяОкончания = РегистрыСведений.НомераПарВремяСоответсвие.Получить(Отбор).ВремяОкончания;
		
		НовыйДокумент.ДатаНачала = НачалоДня(ДатаЗанятия) + (ВремяНачала - НачалоДня(ВремяНачала));
		НовыйДокумент.ДатаОкончания = НачалоДня(ДатаЗанятия) + (ВремяОкончания - НачалоДня(ВремяОкончания));
		НовыйДокумент.Предмет = Занятие.lesson;
		НовыйДокумент.Аудитория = Занятие.location;
		НовыйДокумент.Программа = ПрограммаСсылка;
		НовыйДокумент.Основная = Истина;
		НовыйДокумент.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, ЗначенияИзмерений)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикНажатиеНаЭлементеИзмерения(Элемент, ЭлементИзмерения, ЗначенияИзмерений, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПреподавательПриИзменении(Элемент)
	
	Если Преподаватель <> ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка") И Программа <> ПредопределенноеЗначение("Справочник.УчебныеПрограммы.ПустаяСсылка") Тогда
		ПреподавательДопустим = ПроверитьПреподавательВПрограмме(Преподаватель, Программа);
		
		Если НЕ ПреподавательДопустим Тогда
			ПоказатьПредупреждение(,
				"Выбранный преподаватель не является преподавателем данной учебной программы!",
				, 
				"Предупреждение");
			Преподаватель = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДанные();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПреподавательВПрограмме(ПреподавательСсылка, ПрограммаСсылка)
	
	Для Каждого СтрокаПреподаватель Из ПрограммаСсылка.Преподаватели Цикл
		Если СтрокаПреподаватель.Преподаватель = ПреподавательСсылка Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	ПараметрыФормы = Новый Структура("СозданиеЗадачи", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаСозданияЗадачи", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗадачаСотрудника.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСозданияЗадачи(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ОбновитьДанные();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормаДень(Команда) 
	
	ВариантПериода = "День";
	ВариантПериодаПриИзменении("");
	ВыделитьПериодОтображения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаМесяц(Команда)
	
	ВариантПериода = "Месяц";
	ВариантПериодаПриИзменении("");
	ВыделитьПериодОтображения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаНеделя(Команда)
	
	ВариантПериода = "Неделя";
	ВариантПериодаПриИзменении(""); 
	ВыделитьПериодОтображения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПериодДанных(ВариантПериода, ДатаОтображения)
	
	Результат = Новый Структура("ДатаНачала, ДатаОкончания");
	
	Если ВариантПериода = "День" Тогда
		Результат.ДатаНачала = НачалоДня(ДатаОтображения);
		Результат.ДатаОкончания	= КонецДня(ДатаОтображения);
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		Результат.ДатаНачала = НачалоНедели(ДатаОтображения);
		Результат.ДатаОкончания	= КонецНедели(ДатаОтображения);
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		Результат.ДатаНачала = НачалоНедели(НачалоМесяца(ДатаОтображения));
		Результат.ДатаОкончания	= КонецНедели(КонецМесяца(ДатаОтображения));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВыделитьПериодОтображения(Форма)
	
	Форма.Элементы.ФормаДень.Пометка = Ложь;
	Форма.Элементы.ФормаНеделя.Пометка = Ложь;
	Форма.Элементы.ФормаМесяц.Пометка = Ложь;
	
	Если Форма.ВариантПериода = "День" Тогда
		Форма.Элементы.ФормаДень.Пометка = Истина;
	ИначеЕсли Форма.ВариантПериода = "Неделя" Тогда
		Форма.Элементы.ФормаНеделя.Пометка = Истина;
	ИначеЕсли Форма.ВариантПериода = "Месяц" Тогда
		Форма.Элементы.ФормаМесяц.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
	ОбновитьДанныеПланировщикаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыПланировщика()
	ОбновитьЭлементыПланировщикаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПериодаПриИзменении(Элемент)	
	ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПланировщикаСервер()
	
	Планировщик.Элементы.Очистить();
	Планировщик.ИнтервалыФона.Очистить();
	
	УстановитьОтображениеПланировщика();
	
	ПериодДанных = ПолучитьПериодДанных(ВариантПериода, ДатаОтображения);
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
	
	ЗаполнитьДанныеСервер(ПериодДанных);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеПланировщика()
	
	Если ВариантПериода = "День" Тогда
		
		Планировщик.ОтображатьТекущуюДату = НастройкиОтображения.ОтображатьТекущуюДату;
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
		Планировщик.КратностьПериодическогоВарианта = 24;
		Планировщик.ОтступСНачалаПереносаШкалыВремени = НастройкиОтображения.НачалоРабочегоДня;
		Планировщик.ОтступСКонцаПереносаШкалыВремени = ?(НастройкиОтображения.ОкончаниеРабочегоДня = 0,
		0, 24 - НастройкиОтображения.ОкончаниеРабочегоДня);
		Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Ложь;
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачалаИКонца;
		Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='dddd, d MMMM yyyy'";
		Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=ЧЧ:мм";
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Час;
		
	ИначеЕсли ВариантПериода = "Неделя" Тогда
		
		Планировщик.ОтображатьТекущуюДату = НастройкиОтображения.ОтображатьТекущуюДату;
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
		Планировщик.КратностьПериодическогоВарианта = 24;
		Планировщик.ОтступСНачалаПереносаШкалыВремени = НастройкиОтображения.НачалоРабочегоДня;
		Планировщик.ОтступСКонцаПереносаШкалыВремени = ?(НастройкиОтображения.ОкончаниеРабочегоДня = 0,
		0, 24 - НастройкиОтображения.ОкончаниеРабочегоДня);
		Планировщик.ОтображатьПеренесенныеЗаголовки = Истина;
		Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Ложь;
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.НеОтображать;
		Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='ddd, d MMMM'";
		Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Лево;
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ=ЧЧ:мм";
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.Час;
		
	ИначеЕсли ВариантПериода = "Месяц" Тогда
		
		Планировщик.ОтображатьТекущуюДату = Ложь;
		Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.День;
		Планировщик.КратностьПериодическогоВарианта = 7;
		Планировщик.ОтступСНачалаПереносаШкалыВремени = 0;
		Планировщик.ОтступСКонцаПереносаШкалыВремени = 0;
		Планировщик.ОтображатьПеренесенныеЗаголовки = Ложь;
		Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Истина;
		Планировщик.ОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.НеОтображать;
		Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='ddd, d MMM yyyy'";
		Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
		Планировщик.ШкалаВремени.Элементы[0].Формат = "ДФ='ddd, d MMM yyyy'";
		Планировщик.ШкалаВремени.Элементы[0].Кратность = 1;
		Планировщик.ШкалаВремени.Элементы[0].Единица = ТипЕдиницыШкалыВремени.День;
		
		Интервал = Планировщик.ИнтервалыФона.Добавить(НачалоМесяца(ДатаОтображения), КонецМесяца(ДатаОтображения)); 
		СтруктураЦветов = ПолучитьСтруктуруЦветов();
		Интервал.Цвет = СтруктураЦветов.Серый;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыПланировщикаСервер()
	
	Планировщик.Элементы.Очистить();
	
	ПериодДанных = ПолучитьПериодДанных(ВариантПериода, ДатаОтображения);
	
	ЗаполнитьДанныеСервер(ПериодДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСервер(Знач ПериодДанных)
	
	СписокПреподавателей = Новый СписокЗначений;
	
	Если Преподаватель = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Если Программа <> Справочники.УчебныеПрограммы.ПустаяСсылка() Тогда
			Для Каждого СтрокаПреподаватель Из Программа.Преподаватели Цикл
				СписокПреподавателей.Добавить(СтрокаПреподаватель.Преподаватель);
			КонецЦикла;
			СтрокаФильтр = " И ЗадачаСотрудника.Основная = ЛОЖЬ";
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		СписокПреподавателей.Добавить(Преподаватель);
	КонецЕсли;
	
	Если СписокПреподавателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗадачаСотрудника.Ссылка КАК Ссылка,
		|	ЗадачаСотрудника.ДатаНачала КАК ДатаНачала,
		|	ЗадачаСотрудника.ДатаОкончания КАК ДатаОкончания,
		|	ЗадачаСотрудника.Предмет КАК Предмет,
		|	ЗадачаСотрудника.Тема КАК Тема,
		|	ЗадачаСотрудника.Аудитория КАК Аудитория,
		|	ЗадачаСотрудника.Основная КАК Основная,
		|	ЗадачаСотрудника.Дистанционное КАК Дистанционное,
		|	УчебныеПрограммы.НаименованиеПрограммыСокращенно КАК Программа,
		|	Сотрудники.Наименование КАК Преподаватель,
		|	ЗадачаСотрудника.ТипЗанятия КАК ТипЗанятия
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеПрограммы КАК УчебныеПрограммы
		|		ПО ЗадачаСотрудника.Программа = УчебныеПрограммы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ЗадачаСотрудника.Преподаватель = Сотрудники.Ссылка
		|ГДЕ
		|	ЗадачаСотрудника.ДатаНачала <= &ДатаОкончания
		|	И ЗадачаСотрудника.ДатаОкончания >= &ДатаНачала
		|	И ЗадачаСотрудника.Программа = &Программа
		|	И ЗадачаСотрудника.Преподаватель В (&Преподаватели)
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ" + СтрокаФильтр;
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодДанных.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодДанных.ДатаОкончания);
	Запрос.УстановитьПараметр("Программа", Программа);
	Запрос.УстановитьПараметр("Преподаватели", СписокПреподавателей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(Выборка.ДатаНачала, Выборка.ДатаОкончания);
		ЭлементПланировщика.Значение = Новый Структура;
		
		Если Выборка.Основная Тогда
			СтруктураЦветов = ПолучитьСтруктуруЦветов();
			ЭлементПланировщика.ЦветФона = СтруктураЦветов.Красный;
			ЭлементПланировщика.Значение.Вставить("РедактированиеЗапрещено", Выборка.Основная);
			ЭлементПланировщика.Значение.Вставить("Ссылка", Выборка.Ссылка);
			ПредставлениеЗадачи = Выборка.Предмет + " " + Выборка.ТипЗанятия + " " + Выборка.Аудитория;
			ЭлементПланировщика.Текст = ПредставлениеЗадачи;
			
		Иначе	
			СтруктураЦветов = ПолучитьСтруктуруЦветов();
			ЭлементПланировщика.ЦветФона = СтруктураЦветов.Синий;
			ЭлементПланировщика.Значение.Вставить("РедактированиеЗапрещено", Не Выборка.Основная);
			ЭлементПланировщика.Значение.Вставить("Ссылка", Выборка.Ссылка);
			ПредставлениеЗадачи = Выборка.Тема + " " + Выборка.ТипЗанятия + " " + Выборка.Преподаватель + " " + Выборка.Аудитория;
			ЭлементПланировщика.Текст = ПредставлениеЗадачи;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОтображения = ТекущаяДатаСеанса();
	НастройкиОтображения = Новый Структура();
	НастройкиОтображения.Вставить("НачалоРабочегоДня", 8);
	НастройкиОтображения.Вставить("ОкончаниеРабочегоДня", 23);
	НастройкиОтображения.Вставить("ОтображатьТекущуюДату", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантПериода = "Месяц";
	ВыделитьПериодОтображения(ЭтотОбъект);
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриАктивизации(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Планировщик.ВыделенныеЭлементы.Количество() > 0 Тогда
		ЗначениеЭлемента = Элементы.Планировщик.ВыделенныеЭлементы[0].Значение;
		
		Если ЗначениеЭлемента.Ссылка <> Неопределено Тогда
			ОткрытьФормуЗадачи(ЗначениеЭлемента.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗадачи(ЗадачаСсылка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ЗадачаСсылка);
	
	Если Проверка(ЗадачаСсылка) Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыЗадачи", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗадачаСотрудника.Форма.ФормаДокумента", 
		ПараметрыФормы, 
		ЭтотОбъект,	, , , 
		Оповещение,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормыЗадачи(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ОбновитьДанные();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	
	Если ВариантПериода = "Месяц" Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекущаяДатаСеанса = ТекущаяДата();
		
		Если ТекущиеПериодыОтображения[0].Начало = НачалоДня(ТекущаяДатаСеанса) Тогда
			ДатаОтображения = ТекущаяДатаСеанса;
		
		ИначеЕсли ТекущиеПериодыОтображения[0].Начало < Планировщик.ТекущиеПериодыОтображения[0].Начало Тогда
			ДатаОтображения = ДобавитьМесяц(ДатаОтображения, -1);
		
		ИначеЕсли ТекущиеПериодыОтображения[0].Начало > Планировщик.ТекущиеПериодыОтображения[0].Начало Тогда
			ДатаОтображения = ДобавитьМесяц(ДатаОтображения, 1);
		КонецЕсли;
		
		ПериодДанных = ПолучитьПериодДанных(ВариантПериода, ДатаОтображения);
		Планировщик.ТекущиеПериодыОтображения.Очистить();
		Планировщик.ТекущиеПериодыОтображения.Добавить(ПериодДанных.ДатаНачала, ПериодДанных.ДатаОкончания);
		
		Планировщик.ИнтервалыФона.Очистить();
		Интервал = Планировщик.ИнтервалыФона.Добавить(НачалоМесяца(ДатаОтображения), КонецМесяца(ДатаОтображения));
		
		СтруктураЦветов = ПолучитьСтруктуруЦветов();
		Интервал.Цвет = СтруктураЦветов.Серый;
		
		Если НастройкиОтображения.ОтображатьТекущуюДату Тогда
			Интервал = Планировщик.ИнтервалыФона.Добавить(НачалоДня(ТекущаяДатаСеанса), КонецДня(ТекущаяДатаСеанса));
			Интервал.Цвет = СтруктураЦветов.Синий;
		КонецЕсли;
		
	Иначе
		
		ДатаОтображения = ТекущиеПериодыОтображения[0].Начало;
		ОбновитьЭлементыПланировщика();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруЦветов()
	СтруктураЦветов = Новый Структура();
	СтруктураЦветов.Вставить("Серый", ЦветаПалитры.Серый);
	СтруктураЦветов.Вставить("Синий", ЦветаПалитры.Синий);
	СтруктураЦветов.Вставить("Красный", ЦветаПалитры.Красный);
	Возврат СтруктураЦветов;
КонецФункции

&НаСервере
Функция Проверка(Ссылка)
	Возврат Ссылка.Основная;
КонецФункции
